# LevelsOverlap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..LevelsOverlap Property
BuiltInFailures..::..OverlapFailures Class See Also
---
Highlighted levels overlap.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LevelsOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LevelsOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LevelsOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace